Repository: pa-0/dos2unix
Catalog: dos2unix/po/dos2unix/*.po
Languages: de, eo

source: dos2unix %s (%s) Usage: dos2unix [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c, --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f, --force force conversion of binary files -h, --help give this help -k, --keepdate keep output file date -L, --license display software license -l, --newline add additional newline -n, --newfile write to new file infile original file in new file mode outfile output file in new file mode -o, --oldfile write to old file file ... files to convert in old file mode -q, --quiet quiet mode, suppress all warnings always on in stdio mode -s, --safe skip binary files (default)
de: dos2unix %s (%s) Aufruf: dos2unix [Optionen] [Datei ...] [-n Eingabedatei Ausgabedatei ...] -ascii nur Zeilenumbrüche konvertieren (Vorgabe) -iso Konvertierung zwischen DOS und ISO-8859-1 Zeichensatz -1252 Windows Codepage 1252 verwenden (Westeuropäisch) -437 DOS Codepage 437 verwenden (US) (Vorgabe) -850 DOS Codepage 850 verwenden (Westeuropäisch) -860 DOS Codepage 860 verwenden (Portugiesisch) -863 DOS Codepage 863 verwenden (Kanadisches Französisch) -865 DOS Codepage 865 verwenden (Nordisch) -7 8Bit Zeichen in solche aus dem 7Bit Raum konvertieren -c, --convmode Konvertierungsmodus angeben convmode ascii, 7bit, iso, mac, Standard ist nach ascii -f, --force erzwingt die Umwandlung binärer Dateien -h, --help gibt diese Hilfe -k, --keepdate Datum der Ausgabedatei bleibt erhalten -L, --license Ausgabe der Software-Lizenz -l, --newline fügt einen Zeilenumbruch hinzu -n, --newfile eine neue Datei wird erzeugt Eingabedatei Originaldatei im neue Datei Modus Ausgabedatei Ausgabedatei im neue Datei Modus -o, --oldfile überschreibt die alte Datei Datei ... Die im alte Datei Modus zu konvertierenden Dateien -q, --quiet ruhiger Modus, unterdrückt alle Warnungen ist im stdio Modus immer aktiv -s, --safe überspringt binäre Dateien (Vorgabe)
eo: dos2unix %s (%s) Uzado: dos2unix [elektojn] [dosiero ...] [-n antaŭaĵo kreaĵo ...] -ascii nur traduku linio-finojn (jam enŝaltita) -iso traduku inter DOS kaj ISO-8859-1 literaro -1252 Uzu Vindozan kodpaĝon 1252 (Okcident-Eŭropa) -437 Uzu DOS kodpaĝon 437 (Usona) (jam enŝaltita) -850 Uzu DOS kodpaĝon 850 (Okcident-Eŭropa) -860 Uzu DOS kodpaĝon 860 (Portugala) -863 Uzu DOS kodpaĝon 863 (Kebekia) -865 Uzu DOS kodpaĝon 865 (Nordlandaj) -7 Traduku de 8-bitaj literoj en blankspacon -c, --convmode modo de ŝanĝo ŝanĝmodo ascii, 7bit, iso, mac, provizore elektita ascii -f, --force forte konvertado de netekstaj dosieroj -h, --help diri ĉi tiun mesaĝon -k, --keepdate konservi dato-tempon dosieran -L, --license eldiru permesilon tekstan -l, --newline aldoni markon linian finan -n, --newfile registri novan dosieron antaŭaĵo al antaŭa dosiero metita novmoden kreaĵo al dosiero registrita novmoden -o, --oldfile registri malnovan dosieron dosiero... dosiero(j)n por registri per malnova modo -q, --quiet silente eviti avertojn ĉiam enŝaltata dum stdio modo -s, --safe evitu netekstajn dosierojn (jam ŝaltita)

source: -F, --follow-symlink follow symbolic links and convert the targets -R, --replace-symlink replace symbolic links with converted files (original target files remain unchanged) -S, --skip-symlink keep symbolic links and targets unchanged (default)
de: -F, --follow-symlink folgt symbolischen Verknüpfungen und wandelt die Ziele um -R, --replace-symlink ersetzt symbolische Verknüpfungen durch die umgewandelten Dateien (die Originale Ziele bleiben unangetastet) -S, --skip-symlink symbolische Verknüpfungen und deren Ziele bleiben unangetastet (Vorgabe)
eo: -F, --follow-symlink legu dosierajn ĉenerojn kaj konverti la atingojn -R, --replace-symlink anstataŭe registru dosierajn ĉenerojn per konvertotaj dosieroj (ne-ĉeneraj atingaj dosieroj restas neŝanĝitaj) -S, --skip-symlink retenu dosierajn ĉenerojn kaj atingojn neŝanĝataj (jam ŝaltita)

source: -V, --version display version number
de: -V, --version gibt die Versionsnummer aus
eo: -V, --version diri eldono-numeron

source: Copyright (C) 2009-2011 Erwin Waterlander Copyright (C) 1998 Christian Wurll (Version 3.1) Copyright (C) 1998 Bernd Johannes Wuebben (Version 3.0) Copyright (C) 1994-1995 Benjamin Lin All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
de: Copyright © 2009-2011 Erwin Waterlander Copyright © 1998 Christian Wurll (Version 3.1) Copyright © 1998 Bernd Johannes Wuebben (Version 3.0) Copyright © 1994,1995 Benjamin Lin Alle Rechte vorbehalten. Verbreitung und Verwendung als Quelltext oder Binärdatei, in geänderter oder ungeänderter Form sind gestattet, soweit die folgenden Bedingungen eingehalten werden: 1. Weiterverbreitung des Quellcodes muss den obigen Copyrightshinweis, Diese Liste von Bedingungen sowie den folgenden Haftungsausschlus beibehalten. 2. Weiterverbreitung in binärer Form muss den obigen Copyright-Hinweis in der Dokumentation oder anderem der Distribution beiliegenden Material wiedergeben. DIESE SOFTWARE WIRD VOM AUTHOR WIE VORLIEGT ZUR VERFÜGUNG GESTELLT UND JEGLICHE AUSDRÜCKLICH GENANNTEN ODER IMPLIZITEN GARANTIEN, EINSCHLIESLICH, ABER NICHT DARAUF BESCHRÄNKT, DER GARANTIE DER HANDELBARKEIT UND DER EIGNUNG FÜR EINEN BESTIMMTEN ZWECK WERDEN HIERMIT AUSGESCHLOSSEN. IN KEINEM WIE AUCH IMMER GELAGERTEN FALL KANN DER AUTHOR FÜR IRGENDWELCHE DIREKTEN ODER INDIREKTEN, ZUFÄLLIGEN, BESONDEREN ODER BEISPIELHAFTEN SCHÄDEN (EINSCHLIESSLICH ABER NICHT AUSSCHLIESSLICH DER LIEFERUNG VON ERSATZGÜTERN ODER DIENSTEN;VERLUST DER NUTZBARKEIT, DER DATEN ODER DER GEWINNE ODER ETWAIGEN VERDIENST- AUSFALL-ENTSCHÄDIGUNGEN) HAFTBAR GEMACHT WERDEN, WIE AUCH IMMER SIE VERURSACHT WURDEN UND WELCHE HAFTUNGSMÖGLICHKEIT ZUGRUNDE GELEGT WIRD, SEI ES DURCH VERTRAG, VERBINDLICHKEIT ODER SCHADEN (EINSCHLIESSLICH FAHRLÄSSIGKEIT), DIE AUS DER VERWENDUNG DIESER SOFTWARE ERWÄCHST, SELBST WENN AUF DIE MÖGLICHKIET SOLCHER SCHÄDEN HINGEWIESEN WURDE.

source: With native language support.
de: Mit Unterstützung von Landessprachen.
eo: Uzante denaskan lingvon sistemon.

source: dos2unix: using code page %d.
de: dos2unix: Codepage %d wird verwendet.
eo: dos2unix: uzante kodpaĝon %d.

source: dos2unix: can not write to output file
de: dos2unix: In die Ausgabedatei kann nicht geschrieben werden
eo: dos2unix: ne povas registri dosieren

source: dos2unix: program error, invalid conversion mode %d
de: dos2unix: Programmfehler, der Konvertierungsmodus %d ist unzulässig
eo: dos2unix: programa eraro, neĝustan ŝanĝmodon %d

source: dos2unix: Failed to open temporary output file
de: dos2unix: Die temporäre Ausgabedatei konnte nicht geöffnet werden
eo: dos2unix: malsukcesis malfermi provizoran dosieron registran

source: dos2unix: using %s as temporary file
de: dos2unix: %s wird als temporäre Datei verwendet
eo: dos2unix: uzante %s kiel provizora dosiero

source: dos2unix: problems resolving symbolic link '%s'
de: dos2unix: es gab Probleme beim Auflösen der symbolischen Verknüpfung »%s«
eo: dos2unix: erarojn legante dosieran ĉeneron '%s'

source: output file remains in '%s'
de: Die Ausgabedatei verbleibt in »%s«
eo: kreatan dosieron restas en '%s'

source: dos2unix: problems renaming '%s' to '%s': %s
de: dos2unix: Beim Umbenennen von »%s« zu »%s« sind Probleme aufgetreten: %s
eo: dos2unix: problemojn trovitajn renomigi '%s' al '%s': %s

source: which is the target of symbolic link '%s'
de: welche das Ziel der symbolischen Verknüpfung »%s« ist
eo: kiu estas la atingon de dosiera ĉenero '%s'

source: dos2unix: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
de: dos2unix: Fehler: Der Inhalt der Umgebungsvariablen DOS2UNIX_LOCALEDIR ist zu lang.
eo: dos2unix: eraro: DOS2UNIX_LOCALEDIR tro longiĝis.

source: dos2unix: active code page: %d
de: dos2unix: aktive Codepage: %d
eo: dos2unix: nuntempa kodpaĝo: %d

source: dos2unix: invalid %s conversion mode specified
de: dos2unix: Der angegebene Konvertierungsmodus %s ist unzulässig
eo: dos2unix: neuzebla %s ŝanĝmodo menciita

source: dos2unix: option '%s' requires an argument
de: dos2unix: Die Option »%s« benötigt ein Argument
eo: dos2unix: elekto '%s' bezonas elekto-vorton

source: dos2unix: target of file %s not specified in new file mode
de: dos2unix: Das Ziel der Datei %s wurde für den Neudatei-Modus nicht angegeben
eo: dos2unix: ejon de dosiero %s ne menciita en novmodo dosiera

source: dos2unix: Skipping %s, not a regular file.
de: dos2unix: %s wird übersprungen, da es keine reguläre Datei ist
eo: dos2unix: Pasante %s, dosiero ne tauĝa.

source: dos2unix: Skipping %s, output file %s is a symbolic link.
de: dos2unix: %s wird übersprungen, Ausgabedatei %s ist eine symbolische Verknüpfung.
eo: dos2unix: Evitante %s, atingan dosieron %s jam estas dosiera ĉenero.

source: dos2unix: Skipping symbolic link %s, target is not a regular file.
de: dos2unix: Symbolische Verknüpfung %s wird übersprungen da das Ziel keine reguläre Datei ist.
eo: dos2unix: Evitante dosieran ĉeneron %s, atingon ne estas normala dosiero.

source: dos2unix: Skipping %s, target of symbolic link %s is not a regular file.
de: dos2unix: %s wird übersprungen, das Ziel der symbolischen Verknüpfung %s ist keine reguläre Datei.
eo: dos2unix: Evitante %s, atingon de dosiera ĉenero %s ne estas normala dosiero.

source: dos2unix: Skipping binary file %s
de: dos2unix: binäre Datei %s wird übersprungen
eo: dos2unix: Pasante ne-tekstan dosieron %s

source: dos2unix: code page %d is not supported.
de: dos2unix: Codepage %d wird nicht unterstützt.
eo: dos2unix: kodpaĝo %d ne estas konvertebla.

source: dos2unix: converting file %s to file %s in Unix format ...
de: dos2unix: Datei %s wird zu Datei %s im Unix-Format umgewandelt ...
eo: dos2unix: ŝanĝante dosieron %s al dosiero %s Unix-en ...

source: dos2unix: problems converting file %s to file %s
de: dos2unix: Beim Konvertieren von Datei %s zu Datei %s sind Probleme aufgetreten
eo: dos2unix: problemojn trovitajn dum ŝanĝi dosiero %s al dosiero %s

source: dos2unix: Skipping symbolic link %s.
de: dos2unix: Symbolische Verknüpfung %s wird übersprungen.
eo: dos2unix: Evitante dosieran ĉeneron %s.

source: dos2unix: converting file %s to Unix format ...
de: dos2unix: Datei %s wird ins Unix-Format umgewandelt ...
eo: dos2unix: ŝanĝante dosiero %s Unix-en ...

source: dos2unix: problems converting file %s
de: dos2unix: Beim Umwandeln von Datei %s sind Probleme aufgetreten
eo: dos2unix: problemojn dum ŝanĝi dosiero %s
