Repository: pa-0/dos2unix
Catalog: dos2unix/po/unix2dos/*-x.po
Languages: eo

source: unix2dos %s (%s) Usage: unix2dos [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c, --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f, --force force conversion of binary files -h, --help give this help -k, --keepdate keep output file date -L, --license display software license -l, --newline add additional newline -n, --newfile write to new file infile original file in new file mode outfile output file in new file mode -o, --oldfile write to old file file ... files to convert in old file mode -q, --quiet quiet mode, suppress all warnings always on in stdio mode -s, --safe skip binary files (default)
eo: unix2dos %s (%s) Uzado: dos2unix [elektojn] [dosiero ...] [-n antauxajxo kreajxo ...] -ascii nur traduku linio-finojn (jam ensxaltita) -iso traduku inter DOS kaj ISO-8859-1 literaro -1252 Uzu Vindozan kodpagxon 1252 (Okcident-Euxropa) -437 Uzu DOS kodpagxon 437 (Usona) (jam ensxaltita) -850 Uzu DOS kodpagxon 850 (Okcident-Euxropa) -860 Uzu DOS kodpagxon 860 (Portugala) -863 Uzu DOS kodpagxon 863 (Kebekia) -865 Uzu DOS kodpagxon 865 (Nordlandaj) -7 Traduku de 8-bitaj literoj en blankspacon -c, --convmode modo de sxangxo sxangxmodo ascii, 7bit, iso, mac, provizore elektita ascii -f, --force forte konvertado de netekstaj dosieroj -h, --help diri cxi tiun mesagxon -k, --keepdate konservi dato-tempon dosieran -L, --license eldiru permesilon tekstan -l, --newline aldoni markon linian finan -n, --newfile registri novan dosieron antauxajxo al antauxa dosiero metita novmoden kreajxo al dosiero registrita novmoden -o, --oldfile registri malnovan dosieron dosiero... dosiero(j)n por registri per malnova modo -q, --quiet silente eviti avertojn cxiam ensxaltata dum stdio modo -s, --safe evitu netekstajn dosierojn (jam sxaltita)

source: -F, --follow-symlink follow symbolic links and convert the targets -R, --replace-symlink replace symbolic links with converted files (original target files remain unchanged) -S, --skip-symlink keep symbolic links and targets unchanged (default)
eo: -F, --follow-symlink legu dosierajn cxenerojn kaj konverti la atingojn -R, --replace-symlink anstatauxe registru dosierajn cxenerojn per konvertotaj dosieroj (ne-cxeneraj atingaj dosieroj restas nesxangxitaj) -S, --skip-symlink retenu dosierajn cxenerojn kaj atingojn nesxangxataj (jam sxaltita)

source: -V, --version display version number
eo: -V, --version diri eldono-numeron

source: With native language support.
eo: Uzante denaskan lingvo-sistemon.

source: unix2dos: using code page %d.
eo: unix2dos: uzante kodpagxon %d.

source: unix2dos: can not write to output file
eo: unix2dos: ne povas registri dosieren

source: unix2dos: program error, invalid conversion mode %d
eo: unix2dos: programa eraro, negxustan sxangxmodon %d

source: unix2dos: Failed to open temporary output file
eo: unix2dos: malsukcesis malfermi provizoran dosieron registran

source: unix2dos: using %s as temporary file
eo: unix2dos: uzante %s kiel provizora dosiero

source: unix2dos: problems resolving symbolic link '%s'
eo: unix2dos: erarojn legante dosieran cxeneron '%s'

source: output file remains in '%s'
eo: kreatan dosieron restas en '%s'

source: unix2dos: problems renaming '%s' to '%s': %s
eo: unix2dos: problemojn trovitajn renomigi '%s' al '%s': %s

source: which is the target of symbolic link '%s'
eo: kiu estas la atingon de dosiera cxenero '%s'

source: unix2dos: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
eo: unix2dos: eraro: DOS2UNIX_LOCALEDIR tro longigxis.

source: unix2dos: active code page: %d
eo: unix2dos: nuntempa kodpagxo: %d

source: unix2dos: invalid %s conversion mode specified
eo: unix2dos: neuzebla %s sxangxmodo menciita

source: unix2dos: option '%s' requires an argument
eo: unix2dos: elekto '%s' bezonas elekto-vorton

source: unix2dos: target of file %s not specified in new file mode
eo: unix2dos: ejon de dosiero %s ne menciita en novmodo dosiera

source: unix2dos: Skipping %s, not a regular file.
eo: unix2dos: Pasante %s, dosiero ne taugxa.

source: unix2dos: Skipping %s, output file %s is a symbolic link.
eo: unix2dos: Evitante %s, atingan dosieron %s jam estas dosiera cxenero.

source: unix2dos: Skipping symbolic link %s, target is not a regular file.
eo: unix2dos: Evitante dosieran cxeneron %s, atingon ne estas normala dosiero.

source: unix2dos: Skipping %s, target of symbolic link %s is not a regular file.
eo: unix2dos: Evitante %s, atingon de dosiera cxenero %s ne estas normala dosiero.

source: unix2dos: Skipping binary file %s
eo: unix2dos: Pasante ne-tekstan dosieron %s

source: unix2dos: code page %d is not supported.
eo: unix2dos: kodpagxo %d ne estas konvertebla.

source: unix2dos: converting file %s to file %s in Mac format ...
eo: unix2dos: sxangxante dosiero %s al dosiero %s Mac-en ...

source: unix2dos: converting file %s to file %s in DOS format ...
eo: unix2dos: sxangxante dosiero %s al dosiero %s DOS-en ...

source: unix2dos: problems converting file %s to file %s
eo: unix2dos: problemojn trovitajn dum sxangxi dosiero %s al dosiero %s

source: unix2dos: Skipping symbolic link %s.
eo: unix2dos: Evitante dosieran cxeneron %s.

source: unix2dos: converting file %s to Mac format ...
eo: unix2dos: sxangxante dosiero %s Mac-en ...

source: unix2dos: converting file %s to DOS format ...
eo: unix2dos: sxangxante dosiero %s DOS-en ...

source: unix2dos: problems converting file %s
eo: unix2dos: problemojn dum sxangxi %s
