Repository: pa-0/dos2unix
Catalog: dos2unix/po/unix2dos/*.po
Languages: de, nl

source: unix2dos %s (%s) Usage: unix2dos [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c, --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f, --force force conversion of binary files -h, --help give this help -k, --keepdate keep output file date -L, --license display software license -l, --newline add additional newline -n, --newfile write to new file infile original file in new file mode outfile output file in new file mode -o, --oldfile write to old file file ... files to convert in old file mode -q, --quiet quiet mode, suppress all warnings always on in stdio mode -s, --safe skip binary files (default)
de: unix2dos %s (%s) Aufruf: unix2dos [Optionen] [Datei ...] [-n Eingabedatei Ausgabedatei ...] -ascii nur Zeilenumbrüche konvertieren (Vorgabe) -iso Konvertierung zwischen DOS und ISO-8859-1 Zeichensatz -1252 Windows Codepage 1252 verwenden (Westeuropäisch) -437 DOS Codepage 437 verwenden (US) (Vorgabe) -850 DOS Codepage 850 verwenden (Westeuropäisch) -860 DOS Codepage 860 verwenden (Portugiesisch) -863 DOS Codepage 863 verwenden (Kanadisches Französisch) -865 DOS Codepage 865 verwenden (Nordisch) -7 8Bit Zeichen in solche aus dem 7Bit Raum konvertieren -c, --convmode Konvertierungsmodus angeben convmode ascii, 7bit, iso, mac, Standard ist nach ascii -f, --force erzwingt die Umwandlung binärer Dateien -h, --help gibt diese Hilfe -k, --keepdate Datum der Ausgabedatei bleibt erhalten -L, --license Ausgabe der Software-Lizenz -l, --newline fügt einen Zeilenumbruch hinzu -n, --newfile eine neue Datei wird erzeugt Eingabedatei Originaldatei im neue Datei Modus Ausgabedatei Ausgabedatei im neue Datei Modus -o, --oldfile überschreibt die alte Datei Datei ... Die im alte Datei Modus zu konvertierenden Dateien -q, --quiet ruhiger Modus, unterdrückt alle Warnungen ist im stdio Modus immer aktiv -s, --safe überspringt binäre Dateien (Vorgabe)
nl: unix2dos %s (%s) Usage: unix2dos [opties] [bestand ...] [-n invoerbestand uitvoerbestand ...] -ascii converteer alleen regeleindes (standaard) -iso conversie tussen DOS en ISO-8859-1 lettertekenreeks -1252 Gebruik Windows codetabel 1252 (West-Europees) -437 Gebruik DOS codetabel 437 (VS) (standaard) -850 Gebruik DOS codetabel 850 (West-Europees) -860 Gebruik DOS codetabel 860 (Portugees) -863 Gebruik DOS codetabel 863 (Canadees Frans) -865 Gebruik DOS codetabel 865 (Scandinavisch) -7 Converteer 8 bit lettertekens naar 7 bit spatie -c, --convmode conversiemodus conversiemodus ascii, 7bit, iso, mac, standaard is ascii -f, --force forceer conversie van binaire bestanden -h, --help toon deze help tekst -k, --keepdate behoud datum uitvoerbestand -L, --license toon software licentie -l, --newline voeg extra regeleinde toe -n, --newfile schrijf naar nieuw bestand invoerbestand origineel bestand in nieuw-bestand-modus uitvoerbestand uitvoerbestand in nieuw-bestand-modus -o, --oldfile overschrijf oud bestand bestand ... te converteren bestanden in oud-bestand-modus -q, --quiet stille werking, onderdruk alle waarschuwingen altijd aan in stdio modus -s, --safe sla binaire bestanden over (standaard)

source: -F, --follow-symlink follow symbolic links and convert the targets -R, --replace-symlink replace symbolic links with converted files (original target files remain unchanged) -S, --skip-symlink keep symbolic links and targets unchanged (default)
de: -F, --follow-symlink folgt symbolischen Verknüpfungen und wandelt die Ziele um -R, --replace-symlink ersetzt symbolische Verknüpfungen durch die umgewandelten Dateien (die Originale Ziele bleiben unangetastet) -S, --skip-symlink symbolische Verknüpfungen und deren Ziele bleiben unangetastet (Vorgabe)
nl: -F, --follow-symlink volg symbolische koppelingen en converteer de doelen -R, --replace-symlink vervang symbolische koppelingen door geconverteerde bestanden (originele doelbestanden blijven ongewijzigd) -S, --skip-symlink laat symbolische koppelingen en doelen ongewijzigd (standaard)

source: -V, --version display version number
de: -V, --version gibt die Versionsnummer aus
nl: -V, --version toon versie nummer

source: Copyright (C) 2009-2011 Erwin Waterlander Copyright (C) 1994-1995 Benjamin Lin All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
de: Copyright © 2009,2011 Erwin Waterlander Copyright © 1994,1995 Benjamin Lin Alle Rechte vorbehalten. Verbreitung und Verwendung als Quelltext oder Binärdatei, in geänderter oder ungeänderter Form sind gestattet, soweit die folgenden Bedingungen eingehalten werden: 1. Weiterverbreitung des Quellcodes muss den obigen Copyrightshinweis, Diese Liste von Bedingungen sowie den folgenden Haftungsausschluss beibehalten. 2. Weiterverbreitung in binärer Form muss den obigen Copyright-Hinweis in der Dokumentation oder anderem der Distribution beiliegenden Material wiedergeben. DIESE SOFTWARE WIRD VOM AUTHOR WIE VORLIEGT ZUR VERFÜGUNG GESTELLT UND JEGLICHE AUSDRÜCKLICH GENANNTEN ODER IMPLIZITEN GARANTIEN, EINSCHLIEßLICH, ABER NICHT DARAUF BESCHRÄNKT, DER GARANTIE DER HANDELBARKEIT UND DER EIGNUNG FÜR EINEN BESTIMMTEN ZWECK WERDEN HIERMIT AUSGESCHLOSSEN. IN KEINEM WIE AUCH IMMER GELAGERTEN FALL KANN DER AUTHOR FÜR IRGENDWELCHE DIREKTEN ODER INDIREKTEN, ZUFÄLLIGEN, BESONDEREN ODER BEISPIELHAFTEN SCHÄDEN (EINSCHLIESSLICH ABER NICHT AUSSCHLIESSLICH DER LIEFERUNG VON ERSATZGÜTERN ODER DIENSTEN;VERLUST DER NUTZBARKEIT, DER DATEN ODER DER GEWINNE ODER ETWAIGEN VERDIENST- AUSFALL-ENTSCHÄDIGUNGEN) HAFTBAR GEMACHT WERDEN, WIE AUCH IMMER SIE VERURSACHT WURDEN UND WELCHE HAFTUNGSMÖGLICHKEIT ZUGRUNDE GELEGT WIRD, SEI ES DURCH VERTRAG, VERBINDLICHKEIT ODER SCHADEN (EINSCHLIESSLICH FAHRLÄSSIGKEIT), DIE AUS DER VERWENDUNG DIESER SOFTWARE ERWÄCHST, SELBST WENN AUF DIE MÖGLICHKIET SOLCHER SCHÄDEN HINGEWIESEN WURDE.

source: With native language support.
de: Mit Unterstützung von Landessprachen
nl: Met moedertaal ondersteuning.

source: unix2dos: using code page %d.
de: unix2dos: Codepage %d wird verwendet.
nl: unix2dos: codetabel %d wordt gebruikt.

source: unix2dos: can not write to output file
de: unix2dos: Schreiben in Ausgabedatei nicht möglich
nl: unix2dos: kan niet schrijven naar uitvoerbestand

source: unix2dos: program error, invalid conversion mode %d
de: unix2dos: Programmfehler: ungültiger Konvertierungsmodus %d
nl: unix2dos: programma fout, ongeldige conversie modus %d

source: unix2dos: Failed to open temporary output file
de: unix2dos: Die temporäre Ausgabedatei konnte nicht geöffnet werden
nl: unix2dos: Niet gelukt om tijdelijk uitvoerbestand te openen

source: unix2dos: using %s as temporary file
de: unix2dos: %s wird als temporäre Datei verwendet
nl: unix2dos: %s wordt als tijdelijk bestand gebruikt

source: unix2dos: problems resolving symbolic link '%s'
de: unix2dos: es gab Probleme beim Auflösen der symbolischen Verknüpfung »%s«
nl: unix2dos: problemen met het herleiden van symbolische koppeling '%s'

source: output file remains in '%s'
de: Ausgabedatei verbleibt in »%s«
nl: uitvoerbestand blijft in '%s'

source: unix2dos: problems renaming '%s' to '%s'
de: unix2dos: es gibt Probleme beim Umbenennen von »%s« zu »%s«
nl: unix2dos: problemen met hernoemen van '%s' naar '%s'

source: which is the target of symbolic link '%s'
de: welche das Ziel der symbolischen Verknüpfung »%s« ist
nl: welke het doel is van symbolische koppeling '%s'

source: unix2dos: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
de: unix2dos: Fehler: Der Inhalt der Umgebungsvariablen DOS2UNIX_LOCALEDIR ist zu lang.
nl: unix2dos: fout: Waarde van omgevingsvariabele DOS2UNIX_LOCALEDIR is te lang.

source: unix2dos: active code page: %d
de: unix2dos: aktive Codepage: %d
nl: unix2dos: actieve codetabel: %d

source: unix2dos: invalid %s conversion mode specified
de: unix2dos: der angegebene Konvertierungsmodus %s ist ungültig
nl: unix2dos: ongeldige %s conversie modus gespecificeerd

source: unix2dos: option '%s' requires an argument
de: unix2dos: Die Option »%s« benötigt ein Argument
nl: unix2dos: optie '%s' heeft een argument nodig

source: unix2dos: target of file %s not specified in new file mode
de: unix2dos: das Ziel von Datei %s wurde im neue Datei Modus nicht angegeben
nl: unix2dos: doel van bestand %s is niet gespecificeerd in 'nieuw bestand modus'

source: unix2dos: Skipping %s, not a regular file.
de: unix2dos: %s wird übersprungen da es keine reguläre Datei ist.
nl: unix2dos: %s wordt overgeslagen, omdat het geen regulier bestand is.

source: unix2dos: Skipping %s, output file %s is a symbolic link.
de: unix2dos: %s wird übersprungen, Ausgabedatei %s ist eine symbolische Verknüpfung.
nl: unix2dos: %s wordt overgeslagen, uitvoerbestand %s is een symbolische koppeling.

source: unix2dos: Skipping symbolic link %s, target is not a regular file.
de: unix2dos: Symbolische Verknüpfung %s wird übersprungen da das Ziel keine reguläre Datei ist.
nl: unix2dos: Symbolische koppeling %s wordt overgeslagen, omdat het doel geen regulier bestand is.

source: unix2dos: Skipping %s, target of symbolic link %s is not a regular file.
de: unix2dos: %s wird übersprungen, das Ziel der symbolischen Verknüpfung %s ist keine reguläre Datei.
nl: unix2dos: %s wordt overgeslagen, omdat het doel van symbolische koppeling %s geen regulier bestand is.

source: unix2dos: Skipping binary file %s
de: unix2dos: die binäre Datei %s wird übersprungen
nl: unix2dos: Binair bestand %s wordt overgeslagen

source: unix2dos: code page %d is not supported.
de: unix2dos: Codepage %d wird nicht unterstützt.
nl: unix2dos: code tabel %d wordt niet ondersteund.

source: unix2dos: converting file %s to file %s in Mac format ...
de: unix2dos: Datei %s wird in Datei %s im Mac-Format konvertiert ...
nl: unix2dos: converteren bestand %s naar bestand %s in Mac formaat ...

source: unix2dos: converting file %s to file %s in DOS format ...
de: unix2dos: Datei %s wird in Datei %s im DOS-Format konvertiert ...
nl: unix2dos: converteren bestand %s naar bestand %s in DOS formaat ...

source: unix2dos: problems converting file %s to file %s
de: unix2dos: bei der Konvertierung von Datei %s in Datei %s sind Probleme aufgetreten
nl: unix2dos: problemen met conversie van bestand %s naar bestand %s

source: unix2dos: Skipping symbolic link %s.
de: unix2dos: Symbolische Verknüpfung %s wird übersprungen.
nl: unix2dos: Symbolische koppeling %s wordt overgeslagen.

source: unix2dos: converting file %s to Mac format ...
de: unix2dos: Datei %s wird ins Mac-Format konvertiert ...
nl: unix2dos: converteren bestand %s naar Mac formaat ...

source: unix2dos: converting file %s to DOS format ...
de: unix2dos: Datei %s wird ins DOS-Format konvertiert ...
nl: unix2dos: converteren bestand %s naar DOS formaat ...

source: unix2dos: problems converting file %s
de: unix2dos: beim Konvertieren von Datei %s sind Probleme aufgetreten
nl: unix2dos: problemen met conversie van bestand %s
